r4d10n/esp32p4-c6-wifi-test/sdkconfig.defaults
# Target: ESP32-P4
CONFIG_IDF_TARGET="esp32p4"

# PSRAM (32MB hex mode on Waveshare ESP32-P4-WIFI6)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# Performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# WiFi via esp_wifi_remote + esp-hosted (remote WiFi on ESP32-C6)
# ESP_WIFI_REMOTE_LIBRARY_HOSTED enables the esp-hosted backend
# ESP_HOSTED_ENABLED is auto-set by Kconfig dependencies
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# ESP-Hosted SDIO transport (Waveshare ESP32-P4-WIFI6 board)
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=40
CONFIG_ESP_HOSTED_SDIO_RX_Q_SIZE=40

# Disable watchdogs for testing
CONFIG_ESP_INT_WDT=n
CONFIG_ESP_TASK_WDT_EN=n

# NVS
CONFIG_NVS_ENCRYPTION=n

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# WiFi raw packet injection/monitoring (CustomRpc)
CONFIG_ESP_HOSTED_ENABLE_PEER_DATA_TRANSFER=y
CONFIG_ESP_HOSTED_MAX_CUSTOM_MSG_HANDLERS=8
